{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_12","layers":[{"class_name":"Dense","config":{"units":158,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense49","trainable":true,"batch_input_shape":[null,158],"dtype":"float32"}},{"class_name":"Dense","config":{"units":30,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense50","trainable":true}},{"class_name":"Dense","config":{"units":30,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense51","trainable":true}},{"class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense52","trainable":true}}]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense49/kernel","shape":[158,158],"dtype":"float32"},{"name":"dense_Dense49/bias","shape":[158],"dtype":"float32"},{"name":"dense_Dense50/kernel","shape":[158,30],"dtype":"float32"},{"name":"dense_Dense50/bias","shape":[30],"dtype":"float32"},{"name":"dense_Dense51/kernel","shape":[30,30],"dtype":"float32"},{"name":"dense_Dense51/bias","shape":[30],"dtype":"float32"},{"name":"dense_Dense52/kernel","shape":[30,1],"dtype":"float32"},{"name":"dense_Dense52/bias","shape":[1],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v3.9.0","convertedBy":null}