{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_13","layers":[{"class_name":"Dense","config":{"units":158,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense53","trainable":true,"batch_input_shape":[null,158],"dtype":"float32"}},{"class_name":"Dense","config":{"units":70,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense54","trainable":true}},{"class_name":"Dense","config":{"units":70,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense55","trainable":true}},{"class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense56","trainable":true}}]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense53/kernel","shape":[158,158],"dtype":"float32"},{"name":"dense_Dense53/bias","shape":[158],"dtype":"float32"},{"name":"dense_Dense54/kernel","shape":[158,70],"dtype":"float32"},{"name":"dense_Dense54/bias","shape":[70],"dtype":"float32"},{"name":"dense_Dense55/kernel","shape":[70,70],"dtype":"float32"},{"name":"dense_Dense55/bias","shape":[70],"dtype":"float32"},{"name":"dense_Dense56/kernel","shape":[70,1],"dtype":"float32"},{"name":"dense_Dense56/bias","shape":[1],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v3.9.0","convertedBy":null}